# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO26 object detection model with ASFYOLO
# Model docs: https://docs.ultralytics.com/models/yolo26
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants, i.e. 'model=yolo26n.yaml' will call yolo26.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO26n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO26n head
head:
  - [-1, 1, Conv, [512, 1, 1]] # 11 (From 10 - P5)
  - [4, 1, Conv, [512, 1, 1]]  # 12 (From 4 - P3)
  - [[-1, 6, -2], 1, Zoom_cat, []] # 13 (From 12, 6, 11) -> P3, P4, P5 to P4 scale
  - [-1, 3, C3k2, [512]] # 14 (P4 feature)
  
  - [-1, 1, Conv, [256, 1, 1]] # 15 (From 14 - P4)
  - [2, 1, Conv, [256, 1, 1]]  # 16 (From 2 - P2)
  - [[-1, 4, -2], 1, Zoom_cat, []] # 17 (From 16, 4, 15) -> P2, P3, P4 to P3 scale
  - [-1, 3, C3k2, [256]] # 18 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 19 (From 18 - P3)
  - [[-1, 15], 1, Concat, [1]] # 20 (From 19, 15) -> P3 and P4 to P4 scale
  - [-1, 3, C3k2, [512]] # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 22 (From 21 - P4)
  - [[-1, 11], 1, Concat, [1]] # 23 (From 22, 11) -> P4 and P5 to P5 scale
  - [-1, 3, C3k2, [1024]] # 24 (P5/32-large)

  - [[4, 6, 8], 1, ScalSeq, [256]] # 25 (P3, P4, P5)
  - [[18, -1], 1, Add, [256]] # 26 (P3 small and ScalSeq)

  - [[26, 21, 24], 1, Detect, [nc]] # 27 Detect(P3, P4, P5)
