# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO26 object detection model with AFPN
# Model docs: https://docs.ultralytics.com/models/yolo26
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
end2end: True # whether to use end-to-end mode
reg_max: 1 # DFL bins
scales: # model compound scaling constants, i.e. 'model=yolo26n.yaml' will call yolo26.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO26 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4-P3 feature map
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]] # 6-P4 feature map
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 9
  - [-1, 2, C2PSA, [1024]] # 10-P5 feature map

# YOLO26 head with AFPN
head:
  - [4, 1, Conv, [256, 1, 1]] # 11-downsample backbone P3
  - [6, 1, Conv, [512, 1, 1]] # 12-downsample backbone P4
 
  - [[11, 12], 1, ASFF2, [256, 0]] # 13-P3 scale fusion
  - [[11, 12], 1, ASFF2, [512, 1]] # 14-P4 scale fusion
 
  - [13, 2, C3k2, [256, False]] # 15
  - [14, 2, C3k2, [512, False]] # 16
 
  - [10, 1, Conv, [1024, 1, 1]] # 17-downsample backbone P5
 
  - [[15, 16, 17], 1, ASFF3, [256, 0]] # 18-P3 scale fusion
  - [[15, 16, 17], 1, ASFF3, [512, 1]] # 19-P4 scale fusion
  - [[15, 16, 17], 1, ASFF3, [1024, 2]] # 20-P5 scale fusion
 
  - [18, 2, C3k2, [256, True]]  # 21 (P3/8-small)
  - [19, 2, C3k2, [512, True]]  # 22 (P4/16-medium)
  - [20, 1, C3k2, [1024, True, 0.5, True]]  # 23 (P5/32-large)
  
  - [[21, 22, 23], 1, Detect, [nc]]  # 24 Detect(P3, P4, P5)
